og_bench/opengauss_bulk_insert_threads_8_time_60_tables_8_table_size_1000000.log
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql bulk_insert --pgsql-host=localhost --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Wzh@0401 --pgsql-db=sbtest --tables=8 --table-size=1000000 prepare >> opengauss_bulk_insert_threads_8_time_60_tables_8_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Creating table 'sbtest1'...
Creating table 'sbtest2'...
Creating table 'sbtest3'...
Creating table 'sbtest4'...
Creating table 'sbtest5'...
Creating table 'sbtest6'...
Creating table 'sbtest7'...
Creating table 'sbtest8'...
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql bulk_insert --pgsql-host=localhost --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Wzh@0401 --pgsql-db=sbtest --tables=8 --table-size=1000000 run >> opengauss_bulk_insert_threads_8_time_60_tables_8_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 305895.88 qps: 8.20 (r/w/o: 0.00/8.20/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 222737.06 qps: 6.80 (r/w/o: 0.00/6.80/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 248798.84 qps: 7.60 (r/w/o: 0.00/7.60/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 227029.06 qps: 7.70 (r/w/o: 0.00/7.70/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 160184.02 qps: 5.50 (r/w/o: 0.00/5.50/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 195165.85 qps: 6.70 (r/w/o: 0.00/6.70/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           441
        other:                           0
        total:                           441
    transactions:                        13598861 (222341.15 per sec.)
    queries:                             441    (7.21 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          61.1608s
    total number of events:              13598861

Latency (ms):
         min:                                    0.00
         avg:                                    0.04
         max:                                 3947.23
         95th percentile:                        0.00
         sum:                               478786.49

Threads fairness:
    events (avg/stddev):           1699857.6250/39714.53
    execution time (avg/stddev):   59.8483/0.38

sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_delete --pgsql-host=localhost --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Wzh@0401 --pgsql-db=sbtest --tables=8 --table-size=1000000 cleanup >> opengauss_bulk_insert_threads_8_time_60_tables_8_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...