og_bench/opengauss_oltp_read_write_threads_8_time_60_tables_2_table_size_1000000.log
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_read_write --pgsql-host=localhost --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Wzh@0401 --pgsql-db=sbtest --tables=2 --table-size=1000000 prepare >> opengauss_oltp_read_write_threads_8_time_60_tables_2_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Initializing worker threads...

Creating table 'sbtest1'...
Creating table 'sbtest2'...
Inserting 1000000 records into 'sbtest2'
Inserting 1000000 records into 'sbtest1'
Creating a secondary index on 'sbtest2'...
Creating a secondary index on 'sbtest1'...
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_read_write --pgsql-host=localhost --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Wzh@0401 --pgsql-db=sbtest --tables=2 --table-size=1000000 run >> opengauss_oltp_read_write_threads_8_time_60_tables_2_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 516.84 qps: 10347.00 (r/w/o: 7244.49/2068.04/1034.47) lat (ms,95%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 478.00 qps: 9560.58 (r/w/o: 6692.88/1911.70/956.00) lat (ms,95%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 523.91 qps: 10477.71 (r/w/o: 7333.58/2096.02/1048.11) lat (ms,95%): 29.19 err/s: 0.10 reconn/s: 0.00
[ 40s ] thds: 8 tps: 486.80 qps: 9739.02 (r/w/o: 6818.32/1947.10/973.60) lat (ms,95%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 509.40 qps: 10183.91 (r/w/o: 7128.11/2037.00/1018.80) lat (ms,95%): 29.19 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 503.50 qps: 10070.35 (r/w/o: 7048.96/2014.39/1006.99) lat (ms,95%): 28.67 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            422716
        write:                           120773
        other:                           60389
        total:                           603878
    transactions:                        30193  (502.91 per sec.)
    queries:                             603878 (10058.52 per sec.)
    ignored errors:                      1      (0.02 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0359s
    total number of events:              30193

Latency (ms):
         min:                                    2.43
         avg:                                   15.90
         max:                                  157.16
         95th percentile:                       30.26
         sum:                               480083.09

Threads fairness:
    events (avg/stddev):           3774.1250/36.33
    execution time (avg/stddev):   60.0104/0.01

sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_delete --pgsql-host=localhost --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Wzh@0401 --pgsql-db=sbtest --tables=2 --table-size=1000000 cleanup>> opengauss_oltp_read_write_threads_8_time_60_tables_2_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...