og_bench/opengauss_oltp_update_index_threads_8_time_60_tables_2_table_size_1000000.log
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_update_index --pgsql-host=localhost --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Wzh@0401 --pgsql-db=sbtest --tables=2 --table-size=1000000 prepare >> opengauss_oltp_update_index_threads_8_time_60_tables_2_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Initializing worker threads...

Creating table 'sbtest1'...
Creating table 'sbtest2'...
Inserting 1000000 records into 'sbtest2'
Inserting 1000000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating a secondary index on 'sbtest2'...
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_update_index --pgsql-host=localhost --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Wzh@0401 --pgsql-db=sbtest --tables=2 --table-size=1000000 run >> opengauss_oltp_update_index_threads_8_time_60_tables_2_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 3075.21 qps: 3075.21 (r/w/o: 0.00/3075.21/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 3020.96 qps: 3020.96 (r/w/o: 0.00/3020.96/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 3037.49 qps: 3037.49 (r/w/o: 0.00/3037.49/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 3132.73 qps: 3132.73 (r/w/o: 0.00/3132.73/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 2935.84 qps: 2935.84 (r/w/o: 0.00/2935.84/0.00) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 2628.35 qps: 2628.35 (r/w/o: 0.00/2628.35/0.00) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           178327
        other:                           0
        total:                           178327
    transactions:                        178327 (2971.03 per sec.)
    queries:                             178327 (2971.03 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0203s
    total number of events:              178327

Latency (ms):
         min:                                    0.23
         avg:                                    2.69
         max:                                  154.17
         95th percentile:                        6.09
         sum:                               479888.49

Threads fairness:
    events (avg/stddev):           22290.8750/194.92
    execution time (avg/stddev):   59.9861/0.00

sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_delete --pgsql-host=localhost --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Wzh@0401 --pgsql-db=sbtest --tables=2 --table-size=1000000 cleanup>> opengauss_oltp_update_index_threads_8_time_60_tables_2_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...